<template>

    <div class="container mt-5">
        <h1>Как получить токен API Яндекс.Метрики</h1>

        <div class="articleBody">
            <p>Чтобы это сделать, нужно выполнить 2 шага.</p>
            <p class="jir">1 шаг. Переходим по адресу:</p>
            <p class="jir">oauth.yandex.ru</p>
            <p >Входим в свой аккаунт Яндекс и у вас откроется страница, где вы можете зарегистрировать свое
                приложение.&nbsp;</p>
            <p >Приложение - это условный мини-аккаунт, с помощью которого вы можете получить этот токен и в
                дальнейшем им пользоваться.&nbsp;</p>
            <p >Жмем на "Зарегистрировать новое приложение" подробнее см. видео.</p>
            <p >Указываем название приложения.&nbsp;</p>
            <p >В разделе Платформы - выбираем веб-сервисы и выбираем подставить URL для разработки.</p>
            <p >Спускаемся ниже и ставим галочки в разделе Яндекс Метрика.&nbsp;</p>
            <p >После этого нажимаем на кнопку "Создать приложение".&nbsp;</p>
            <p >Когда оно будет создано, вы получите ID приложения.</p>
            <p class="jir">Шаг 2. Открываем новую вкладку и переходим по адресу:</p>
            <p class="jir"><a
                    href="https://oauth.yandex.ru/authorize?response_type=token&amp;client_id=XXXXXX">https://oauth.yandex.ru/authorize?response_type=token&amp;client_id=XXXXXX</a>
            </p>
            <p class="jir">В этот адрес вам нужно вместо XXXXXX подставить ID вашего приложения, которое вы только что
                создали.&nbsp;</p>
            <p >Остается только нажать на "Разрешить" и мы получаем тот самый токен, который нам нужен.
                Скопируйте его в надежное место, в дальнейшем он вам еще понадобиться.</p>
            <p >Такая процедура получения токена в системе Яндекс Метрика.&nbsp;</p>
            <p >Если хотите продолжить знакомиться с API Яндекс Метрики, жмите на Содержание или Далее.</p>
        </div>

    </div>

</template>

<script>
export default {

}
</script>
<style>
    .articleBody{
        font-size: 18px;
    }
    .jir{
        font-weight: 500;
    }
</style>